// index.ts
// 获取应用实例
const app = getApp<IAppOption>()
Page({
  data: {
    copyright: 'Copyright © 2021-2031 TD.All Rights Reserved.',
    partList:[
        {
            "id":"0",
            "title":"抖音赋值张贴评论员；一秒一条；一条评论五毛钱；先拿钱后评论，大量要人！",
            "price":60,
            "unit":"小时",
            "content":"工作内容： 有痘印就可以做，只需要赋值粘贴，先拿钱后办事，无需任何押金，直接就上手，每秒一个，一个0.5元-1元，进群拿完红包后赋值对应内容点击分享链接进入抖音区粘贴，每天有几百个账户可以提取，先到先得",
            "tags":["置顶","日结"]
          },
          {
            "id":"1",
            "title":"抖音赋值张贴评论员；一秒一条；一条评论五毛钱；先拿钱后评论，大量要人！",
            "price":60,
            "unit":"小时",
            "content":"工作内容： 有痘印就可以做，只需要赋值粘贴，先拿钱后办事，无需任何押金，直接就上手，每秒一个，一个0.5元-1元，进群拿完红包后赋值对应内容点击分享链接进入抖音区粘贴，每天有几百个账户可以提取，先到先得",
            "tags":["置顶","线上兼职","日结"]
          },
          {
            "id":"2",
            "title":"淘宝京东退换客服",
            "price":20,
            "unit":"小时",
            "content":"工作内容： 有痘印就可以做，只需要赋值粘贴，先拿钱后办事，无需任何押金，直接就上手，每秒一个，一个0.5元-1元，进群拿完红包后赋值对应内容点击分享链接进入抖音区粘贴，每天有几百个账户可以提取，先到先得",
            "tags":["置顶","线上兼职"]
          },
          {
            "id":"3",
            "title":"抖音赋值张贴评论员；一秒一条；一条评论五毛钱；先拿钱后评论，大量要人！",
            "price":200,
            "unit":"每天",
            "content":"工作内容： 有痘印就可以做，只需要赋值粘贴，先拿钱后办事，无需任何押金，直接就上手，每秒一个，一个0.5元-1元，进群拿完红包后赋值对应内容点击分享链接进入抖音区粘贴，每天有几百个账户可以提取，先到先得",
            "tags":["置顶","日结"]
          },
          {
            "id":"4",
            "title":"抖音赋值张贴评论员；一秒一条；一条评论五毛钱；先拿钱后评论，大量要人！",
            "price":30,
            "unit":"小时",
            "content":"工作内容： 有痘印就可以做，只需要赋值粘贴，先拿钱后办事，无需任何押金，直接就上手，每秒一个，一个0.5元-1元，进群拿完红包后赋值对应内容点击分享链接进入抖音区粘贴，每天有几百个账户可以提取，先到先得",
            "tags":["置顶"]
          },
          {
            "id":"5",
            "title":"淘宝京东退换客服",
            "price":20,
            "unit":"小时",
            "content":"工作内容： 有痘印就可以做，只需要赋值粘贴，先拿钱后办事，无需任何押金，直接就上手，每秒一个，一个0.5元-1元，进群拿完红包后赋值对应内容点击分享链接进入抖音区粘贴，每天有几百个账户可以提取，先到先得",
            "tags":["置顶","线上兼职","日结"]
          },
          {
            "id":"6",
            "title":"抖音赋值张贴评论员；一秒一条；一条评论五毛钱；先拿钱后评论，大量要人！",
            "price":200,
            "unit":"每天",
            "content":"工作内容： 有痘印就可以做，只需要赋值粘贴，先拿钱后办事，无需任何押金，直接就上手，每秒一个，一个0.5元-1元，进群拿完红包后赋值对应内容点击分享链接进入抖音区粘贴，每天有几百个账户可以提取，先到先得",
            "tags":["置顶","日结"]
          },
          {
            "id":"7",
            "title":"抖音赋值张贴评论员；一秒一条；一条评论五毛钱；先拿钱后评论，大量要人！",
            "price":30,
            "unit":"小时",
            "content":"工作内容： 有痘印就可以做，只需要赋值粘贴，先拿钱后办事，无需任何押金，直接就上手，每秒一个，一个0.5元-1元，进群拿完红包后赋值对应内容点击分享链接进入抖音区粘贴，每天有几百个账户可以提取，先到先得",
            "tags":["置顶","线上兼职"]
          },
    ],
    loadingProps: {
        size: '60rpx',
      },
      rowCol: [
        { width: '100%', height: '342rpx' },
        [
          { width: '340rpx', height: '32rpx' },
          { width: '340rpx', height: '32rpx', marginLeft: '22rpx' },
        ],
        [
          { width: '218rpx', height: '32rpx' },
          { width: '218rpx', height: '32rpx', marginLeft: '144rpx' },
        ],
      ],
  },
  onLoad() {
  },
  getList(){
  },
  handleClick(){
    wx.navigateTo({
        url: "/pages/detail/detail",
      })
},
  handleTimeout() {
    wx.showToast({
      title: '刷新成功',
      icon: 'success',
    });
  },
  onShareAppMessage(){
    return {
        title: '单页面分享',
        path: "",
        imageUrl:"https://api.vvhan.com/api/acgimg",
    } 
  },
  onShareTimeline: function () {
    return {
    title: "龙猫兼职",
    imageUrl: "https://api.vvhan.com/api/acgimg"
    }
    },
})
