  Page({
    data: {
        backTopTheme: 'round',
        backTopText: '顶部',
        backTop:false,
        doubleColumnsTree: {
            options: [
                {
                  label:"东莞",
                  value:"0",
                  options:[
                      {
                          label:"东城区",
                          value:"0-0",
                      },
                      {
                          label:"莞城区",
                          value:"0-1",
                      },
                      {
                          label:"水乡片区",
                          value:"0-2",
                      },
                  ]
                },
                {
                  label:"深圳",
                  value:"1",
                  options:[
                      {
                          label:"福田区",
                          value:"1-0",
                      },
                      {
                          label:"龙华区",
                          value:"1-1",
                      },
                      {
                          label:"龙岗区",
                          value:"1-2",
                      },
                      {
                        label:"罗湖区",
                        value:"1-3",
                    },
                    {
                        label:"宝安区",
                        value:"1-4",
                    },
                    {
                        label:"坪山区",
                        value:"1-5",
                    },
                    {
                        label:"光明区",
                        value:"1-6",
                    },
                  ]
                }
            ],
            value: ['0', '0-0'],
          }, 
          partList:[
            {
                "id":"0",
                "title":"抖音赋值张贴评论员；一秒一条；一条评论五毛钱；先拿钱后评论，大量要人！",
                "price":60,
                "unit":"小时",
                "content":"工作内容： 有痘印就可以做，只需要赋值粘贴，先拿钱后办事，无需任何押金，直接就上手，每秒一个，一个0.5元-1元，进群拿完红包后赋值对应内容点击分享链接进入抖音区粘贴，每天有几百个账户可以提取，先到先得",
                "tags":["置顶","日结"]
              },
              {
                "id":"1",
                "title":"抖音赋值张贴评论员；一秒一条；一条评论五毛钱；先拿钱后评论，大量要人！",
                "price":60,
                "unit":"小时",
                "content":"工作内容： 有痘印就可以做，只需要赋值粘贴，先拿钱后办事，无需任何押金，直接就上手，每秒一个，一个0.5元-1元，进群拿完红包后赋值对应内容点击分享链接进入抖音区粘贴，每天有几百个账户可以提取，先到先得",
                "tags":["置顶","线上兼职","日结"]
              },
              {
                "id":"2",
                "title":"淘宝京东退换客服",
                "price":20,
                "unit":"小时",
                "content":"工作内容： 有痘印就可以做，只需要赋值粘贴，先拿钱后办事，无需任何押金，直接就上手，每秒一个，一个0.5元-1元，进群拿完红包后赋值对应内容点击分享链接进入抖音区粘贴，每天有几百个账户可以提取，先到先得",
                "tags":["置顶","线上兼职"]
              },
              {
                "id":"3",
                "title":"抖音赋值张贴评论员；一秒一条；一条评论五毛钱；先拿钱后评论，大量要人！",
                "price":200,
                "unit":"每天",
                "content":"工作内容： 有痘印就可以做，只需要赋值粘贴，先拿钱后办事，无需任何押金，直接就上手，每秒一个，一个0.5元-1元，进群拿完红包后赋值对应内容点击分享链接进入抖音区粘贴，每天有几百个账户可以提取，先到先得",
                "tags":["置顶","日结"]
              },
              {
                "id":"4",
                "title":"抖音赋值张贴评论员；一秒一条；一条评论五毛钱；先拿钱后评论，大量要人！",
                "price":30,
                "unit":"小时",
                "content":"工作内容： 有痘印就可以做，只需要赋值粘贴，先拿钱后办事，无需任何押金，直接就上手，每秒一个，一个0.5元-1元，进群拿完红包后赋值对应内容点击分享链接进入抖音区粘贴，每天有几百个账户可以提取，先到先得",
                "tags":["置顶"]
              },
              {
                "id":"5",
                "title":"淘宝京东退换客服",
                "price":20,
                "unit":"小时",
                "content":"工作内容： 有痘印就可以做，只需要赋值粘贴，先拿钱后办事，无需任何押金，直接就上手，每秒一个，一个0.5元-1元，进群拿完红包后赋值对应内容点击分享链接进入抖音区粘贴，每天有几百个账户可以提取，先到先得",
                "tags":["置顶","线上兼职","日结"]
              },
              {
                "id":"6",
                "title":"抖音赋值张贴评论员；一秒一条；一条评论五毛钱；先拿钱后评论，大量要人！",
                "price":200,
                "unit":"每天",
                "content":"工作内容： 有痘印就可以做，只需要赋值粘贴，先拿钱后办事，无需任何押金，直接就上手，每秒一个，一个0.5元-1元，进群拿完红包后赋值对应内容点击分享链接进入抖音区粘贴，每天有几百个账户可以提取，先到先得",
                "tags":["置顶","日结"]
              },
              {
                "id":"7",
                "title":"抖音赋值张贴评论员；一秒一条；一条评论五毛钱；先拿钱后评论，大量要人！",
                "price":30,
                "unit":"小时",
                "content":"工作内容： 有痘印就可以做，只需要赋值粘贴，先拿钱后办事，无需任何押金，直接就上手，每秒一个，一个0.5元-1元，进群拿完红包后赋值对应内容点击分享链接进入抖音区粘贴，每天有几百个账户可以提取，先到先得",
                "tags":["置顶","线上兼职"]
              },
              {
                "id":"8",
                "title":"抖音赋值张贴评论员；一秒一条；一条评论五毛钱；先拿钱后评论，大量要人！",
                "price":200,
                "unit":"每天",
                "content":"工作内容： 有痘印就可以做，只需要赋值粘贴，先拿钱后办事，无需任何押金，直接就上手，每秒一个，一个0.5元-1元，进群拿完红包后赋值对应内容点击分享链接进入抖音区粘贴，每天有几百个账户可以提取，先到先得",
                "tags":["置顶","日结"]
              },
              {
                "id":"9",
                "title":"抖音赋值张贴评论员；一秒一条；一条评论五毛钱；先拿钱后评论，大量要人！",
                "price":30,
                "unit":"小时",
                "content":"工作内容： 有痘印就可以做，只需要赋值粘贴，先拿钱后办事，无需任何押金，直接就上手，每秒一个，一个0.5元-1元，进群拿完红包后赋值对应内容点击分享链接进入抖音区粘贴，每天有几百个账户可以提取，先到先得",
                "tags":["置顶","线上兼职"]
              },
              {
                "id":"10",
                "title":"抖音赋值张贴评论员；一秒一条；一条评论五毛钱；先拿钱后评论，大量要人！",
                "price":30,
                "unit":"小时",
                "content":"工作内容： 有痘印就可以做，只需要赋值粘贴，先拿钱后办事，无需任何押金，直接就上手，每秒一个，一个0.5元-1元，进群拿完红包后赋值对应内容点击分享链接进入抖音区粘贴，每天有几百个账户可以提取，先到先得",
                "tags":["置顶"]
              },
              {
                "id":"11",
                "title":"淘宝京东退换客服",
                "price":20,
                "unit":"小时",
                "content":"工作内容： 有痘印就可以做，只需要赋值粘贴，先拿钱后办事，无需任何押金，直接就上手，每秒一个，一个0.5元-1元，进群拿完红包后赋值对应内容点击分享链接进入抖音区粘贴，每天有几百个账户可以提取，先到先得",
                "tags":["置顶","线上兼职","日结"]
              },
        ],
        loadingProps: {
            size: '60rpx',
          },
          rowCol: [
            { width: '100%', height: '342rpx' },
            [
              { width: '340rpx', height: '32rpx' },
              { width: '340rpx', height: '32rpx', marginLeft: '22rpx' },
            ],
            [
              { width: '218rpx', height: '32rpx' },
              { width: '218rpx', height: '32rpx', marginLeft: '144rpx' },
            ],
          ],
    },
    handleTreeSelect(e:any) {
        console.log(e)
        this.setData({
          'doubleColumnsTree.value': e.detail.value,
        });   
      },
      onToTop(e:any) {
        console.log('backToTop', e);
      }, 
    
      onPageScroll(e){
        if(e.scrollTop>200){
          this.setData({
            backTop:true
          })
        }else{
          this.setData({
            backTop:false
          })
        }
      },
      handleTimeout() {
        wx.showToast({
          title: '刷新成功',
          icon: 'success',
        });
      },
    onLoad() {
    },

    onReady() { 
    },  

    onShow() {
        
    },

    onHide() {
    },

    onUnload() {
    },

    onPullDownRefresh() {
    }, 
    
    onReachBottom() {
    },

    onShareAppMessage() {
    }
})